[
  {
    "subject": "Gershon Baskin",
    "role": "Israeli Peace Activist",
    "affiliation": "Israeli–Palestinian Center for Research and Information",
    "category": "peace-advocates",
    "source_context": "Co-founder of IPCRI; facilitator of prisoner swap (Gilad Shalit); peace dialogues and public mediation since 1990s",
    "overall_alignment": "Pass",
    "pillars": [
      {
        "pillar": "Reject targeting of civilians",
        "assessment": "✅ Pass",
        "evidence": "Baskin consistently condemns violence from both sides, facilitated ceasefire negotiations, and refuses any justification of civilian targeting."
      },
      {
        "pillar": "Accountability for Hamas / PA rejectionism",
        "assessment": "⚠️ Partial",
        "evidence": "He critiques Hamas and PA rejectionism, but occasionally softens critique to protect lines of dialogue."
      },
      {
        "pillar": "Accountability for Israeli far-right rejectionism",
        "assessment": "✅ Pass",
        "evidence": "Baskin openly opposes Israeli settler expansion, right-wing incitement, and policies that undermine peace efforts."
      },
      {
        "pillar": "Verified, truthful sources",
        "assessment": "✅ Strong",
        "evidence": "Baskin relies on firsthand experiences, credible journalism, and transparent records from negotiations and conflict resolution."
      },
      {
        "pillar": "Humanize both peoples",
        "assessment": "✅ Pass",
        "evidence": "He emphasizes empathy for both Palestinians and Israelis, highlighting mutual suffering and shared aspirations in all public dialogues."
      },
      {
        "pillar": "Vision for Dignity, Coexistence & Peace",
        "assessment": "✅ Pass",
        "evidence": "He articulates a detailed, realistic peace framework rooted in civic partnership, two states, and security parity."
      }
    ],
    "strengths": [
      "Bridge-building between hostile communities",
      "Rejects violence and empowers dialogue",
      "Articulates a morally integrated peace vision"
    ],
    "weaknesses": [
      "May minimize Palestinian leadership flaws to maintain negotiation",
      "Limited engagement with public emotions compared to policy detail"
    ],
    "full_conclusion": "Gershon Baskin exemplifies moral clarity through sustained peace activism. His record on nonviolence, truth, and mutual humanization is robust. Though occasionally guarded in critique of Palestinian leadership, his strategic diplomacy and consistent emphasis on coexistence earn him a solid MMR Pass rating."
  },
  {
    "subject": "Sulaiman Khatib",
    "role": "Palestinian Peace Activist",
    "affiliation": "Combatants for Peace",
    "category": "peace-advocates",
    "source_context": "Former militant turned nonviolent leader; co-founder of Combatants for Peace; public narrative reconciliation since early 2000s",
    "overall_alignment": "Pass",
    "pillars": [
      {
        "pillar": "Reject targeting of civilians",
        "assessment": "✅ Pass",
        "evidence": "After renouncing violence, Khatib has vocally opposed all forms of civilian targeting and emphasized peaceful resistance."
      },
      {
        "pillar": "Accountability for Hamas / PA rejectionism",
        "assessment": "⚠️ Partial",
        "evidence": "Criticizes Hamas for violence and promotes civil disobedience, but is less direct on PA failures or institutional incitement."
      },
      {
        "pillar": "Accountability for Israeli far-right rejectionism",
        "assessment": "✅ Pass",
        "evidence": "Speaks clearly against Israeli settler extremism, apartheid practices, and ultranationalist state policies."
      },
      {
        "pillar": "Verified, truthful sources",
        "assessment": "✅ Strong",
        "evidence": "His activism is grounded in lived experience, survivor testimony, and dialogue transcripts; avoids propaganda or denial."
      },
      {
        "pillar": "Humanize both peoples",
        "assessment": "✅ Pass",
        "evidence": "Regularly highlights shared pain and the moral complexity of both sides; facilitates narrative exchanges."
      },
      {
        "pillar": "Vision for Dignity, Coexistence & Peace",
        "assessment": "✅ Pass",
        "evidence": "Promotes nonviolent cohabitation, political equity, and restorative justice through joint organizing and visioning."
      }
    ],
    "strengths": [
      "Embodies moral transformation and bridge-building",
      "Publicly renounces violence and elevates shared stories",
      "Champions equity and dignity across divides"
    ],
    "weaknesses": [
      "Soft on PA institutional critique",
      "Narrative-heavy style may underemphasize political frameworks"
    ],
    "full_conclusion": "Sulaiman Khatib meets MMR's structural and emotional expectations. His story is a rare transformation from violence to reconciliation, and his message reflects both truth and moral vision. Though less engaged with formal politics, he advances a peace rooted in dignity and shared humanization."
  },
  {
    "subject": "Sally Abed",
    "role": "Civic Organizer",
    "affiliation": "Standing Together",
    "source_context": "Leads Standing Together’s Arab-Jewish coalition work; organizes nonviolent actions and speaks across Western and Middle Eastern venues",
    "overall_alignment": "Pass",
    "pillars": [
      {
        "pillar": "Reject targeting of civilians",
        "assessment": "✅ Strong",
        "evidence": "Consistently condemns all violence against civilians and grounds her activism in safety and shared humanity."
      },
      {
        "pillar": "Accountability for Hamas / PA rejectionism",
        "assessment": "⚠️ Partial",
        "evidence": "Rarely speaks explicitly about Hamas or PA rejectionism; focuses on building joint civic power rather than party critique."
      },
      {
        "pillar": "Accountability for Israeli far-right rejectionism",
        "assessment": "✅ Pass",
        "evidence": "Challenges the Israeli far-right publicly, especially on policies of occupation, inequality, and incitement."
      },
      {
        "pillar": "Verified, truthful sources",
        "assessment": "✅ Strong",
        "evidence": "Uses trauma-informed, community-sourced, and rigorously fact-checked narratives in her organizing and media appearances."
      },
      {
        "pillar": "Humanize both peoples",
        "assessment": "✅ Pass",
        "evidence": "Centers Arab-Jewish partnerships, shared economic justice, and mutual safety in all public messages."
      },
      {
        "pillar": "Vision for Dignity, Coexistence & Peace",
        "assessment": "✅ Pass",
        "evidence": "Advocates a shared civic future with dignity, economic rights, and security for both peoples under one democratic framework."
      }
    ],
    "strengths": [
      "Builds cross-community organizing infrastructure",
      "Frames shared economic and civic dignity",
      "Communicates trauma and justice with moral poise"
    ],
    "weaknesses": [
      "Avoids direct naming of Hamas or PA incitement",
      "Strategically avoids ideological confrontation in favor of broad coalitions"
    ],
    "full_conclusion": "Sally Abed scores strongly across MMR pillars through truth, empathy, and vision. Her coalition approach avoids direct political entanglement but prioritizes dignity and inclusion. Her moral clarity and civic commitment make her a powerful model for MMR-aligned activism."
  },
  {
    "subject": "Itamar Ben‑Gvir",
    "role": "Minister of National Security",
    "affiliation": "Otzma Yehudit / Israeli Government",
    "category": "israeli-politicians",
    "source_context": "Known for extremist nationalist positions, street provocations, support for settler expansion; holds public office since 2022",
    "overall_alignment": "Fail",
    "pillars": [
      {
        "pillar": "Reject targeting of civilians",
        "assessment": "❌ Fail",
        "evidence": "Ben‑Gvir has praised violence against Palestinians and opposed police interventions in settler attacks—effectively enabling civilian harm."
      },
      {
        "pillar": "Accountability for Hamas / PA rejectionism",
        "assessment": "⚠️ Mixed",
        "evidence": "He condemns Hamas but frames it as justification for broader punitive policies; lacks structural moral clarity on ending occupation or settler violence."
      },
      {
        "pillar": "Accountability for Israeli far‑right rejectionism",
        "assessment": "❌ Fail",
        "evidence": "Ben‑Gvir aligns with religious-nationalist settler ideology, and refuses accountability for far‑right incitement or violence."
      },
      {
        "pillar": "Verified, truthful sources",
        "assessment": "⚠️ Mixed",
        "evidence": "Deploys selective security incidents and inflammatory rhetoric to stoke fear—with little contextual nuance or cross-community data."
      },
      {
        "pillar": "Humanize both peoples",
        "assessment": "❌ Fail",
        "evidence": "His public discourse stigmatizes Palestinians as enemies, lacking any empathy for their civilian suffering or humanity."
      },
      {
        "pillar": "Vision for Dignity, Coexistence & Peace",
        "assessment": "❌ Fail",
        "evidence": "Articulates no shared vision; promotes exclusionary nationalist goals and has no agenda for peace or mutual recognition."
      }
    ],
    "strengths": [
      "Outspoken clarity on security issues",
      "Effective mobilizer within his political base"
    ],
    "weaknesses": [
      "Glorifies settler violence",
      "Erases Palestinian humanity",
      "No constructive peace or accountability framework"
    ],
    "full_conclusion": "Itamar Ben‑Gvir represents a deeply unbalanced moral posture under MMR. His encouragement of civilian targeting, rejectionist rhetoric, and absence of moral framework for coexistence put him firmly in MMR Fail territory."
  },
  {
    "subject": "Bezalel Smotrich",
    "role": "Minister of Finance",
    "affiliation": "Religious Zionist Party / Israeli Government",
    "category": "israeli-politicians",
    "source_context": "Leads far‑right religious‑nationalist bloc; openly opposes Palestinian statehood; supports settler expansion",
    "overall_alignment": "Fail",
    "pillars": [
      {
        "pillar": "Reject targeting of civilians",
        "assessment": "⚠️ Weak",
        "evidence": "Though not directly endorsing violence, Smotrich supports policies that enable settler violence and constraints on Palestinian civilians."
      },
      {
        "pillar": "Accountability for Hamas / PA rejectionism",
        "assessment": "⚠️ Mixed",
        "evidence": "Criticizes Palestinian leadership broadly but conflates militant and civilian populations, often ignoring structural Israeli responsibility."
      },
      {
        "pillar": "Accountability for Israeli far‑right rejectionism",
        "assessment": "❌ Fail",
        "evidence": "Smotrich himself advocates for religious-nationalist power, shielding extremist factions and rewarding incitors with funding and legitimacy."
      },
      {
        "pillar": "Verified, truthful sources",
        "assessment": "⚠️ Mixed",
        "evidence": "Uses ideological narratives to justify cliff-edge policies—lacking balanced sourcing or acknowledgment of Palestinian suffering."
      },
      {
        "pillar": "Humanize both peoples",
        "assessment": "⚠️ Weak",
        "evidence": "His discourse frames Palestinians as collective adversaries with minimal recognition of their civilian condition or rights."
      },
      {
        "pillar": "Vision for Dignity, Coexistence & Peace",
        "assessment": "❌ Fail",
        "evidence": "Opposes two-state concept and promotes unilateral Israeli sovereignty over all territories—offering no pathway to peace."
      }
    ],
    "strengths": [],
    "weaknesses": [
      "Reinforces settler extremism",
      "Absorbs power without accountability",
      "Demands expansion without recognition of others"
    ],
    "full_conclusion": "Bezalel Smotrich personifies far-right nationalist power without moral reciprocity. His support for settlement growth, de facto antisymmetric policies, and rejection of dual narrative positions him at MMR Fail."
  },
  {
    "subject": "Benny Gantz",
    "role": "Opposition Leader / Former Minister of Defense",
    "affiliation": "National Unity Party",
    "category": "israeli-politicians",
    "source_context": "Military officer turned politician; advocated for conditional Palestinian development during defense tenure; political leadership since 2018",
    "overall_alignment": "Partial",
    "pillars": [
      {
        "pillar": "Reject targeting of civilians",
        "assessment": "⚠️ Partial",
        "evidence": "Gantz has publicly supported rules-of-engagement to minimize civilian harm but oversaw military operations in Gaza with significant casualties."
      },
      {
        "pillar": "Accountability for Hamas / PA rejectionism",
        "assessment": "✅ Pass",
        "evidence": "Freely criticizes Hamas violence and calls for dismantling their military capabilities while endorsing conditional cooperation with PA."
      },
      {
        "pillar": "Accountability for Israeli far‑right rejectionism",
        "assessment": "⚠️ Weak",
        "evidence": "Rarely confronts right-wing incitement; in government, he tolerated coalition partners with extremist views."
      },
      {
        "pillar": "Verified, truthful sources",
        "assessment": "⚠️ Mixed",
        "evidence": "Uses official military briefings but avoids harder truths about Israeli impact in Gaza or West Bank occupation."
      },
      {
        "pillar": "Humanize both peoples",
        "assessment": "⚠️ Mixed",
        "evidence": "Occasionally acknowledges Palestinian civilian toll but frames it almost entirely through a security lens."
      },
      {
        "pillar": "Vision for Dignity, Coexistence & Peace",
        "assessment": "⚠️ Partial",
        "evidence": "Supports a two-state framework without highly publicized advocacy; lacks emotional vision or civic co-design language."
      }
    ],
    "strengths": [
      "Critiques Hamas vigorously with security focus",
      "Endorses conditional cooperation with PA"
    ],
    "weaknesses": [
      "Weak on right-wing Israeli accountability",
      "Operationally tied to military harm in Gaza",
      "Limited moral vision or emotional empathy"
    ],
    "full_conclusion": "Benny Gantz shows moderate alignment: he condemns militant violence and supports two-state diplomacy, but his military record and coalition compromises limit his moral clarity under MMR. His posture is Mixed-Partial."
  },
  {
    "subject": "Yair Lapid",
    "role": "Opposition Leader / Former Prime Minister",
    "affiliation": "Yesh Atid",
    "category": "israeli-politicians",
    "source_context": "Centrist politician; governed 2022–2023; advocated for secularism, civil rights, cautious Palestinian engagement",
    "overall_alignment": "Partial",
    "pillars": [
      {
        "pillar": "Reject targeting of civilians",
        "assessment": "✅ Pass",
        "evidence": "Lapid has condemned extremist attacks on both Israelis and Palestinians, with clear statements against civilian violence."
      },
      {
        "pillar": "Accountability for Hamas / PA rejectionism",
        "assessment": "⚠️ Partial",
        "evidence": "Criticizes Hamas for terrorism; cautiously addresses PA limitations but avoids deeper systemic critique."
      },
      {
        "pillar": "Accountability for Israeli far‑right rejectionism",
        "assessment": "✅ Pass",
        "evidence": "Publicly decries ultra-nationalist incitement, rallies against judicial overreach, and supports civil democratic norms."
      },
      {
        "pillar": "Verified, truthful sources",
        "assessment": "✅ Strong",
        "evidence": "Lapid engages multiple sources—civil society, media, personal testimony—to frame balanced policy positions."
      },
      {
        "pillar": "Humanize both peoples",
        "assessment": "⚠️ Partial",
        "evidence": "Affirms Israeli grief and Palestinian rights but seldom portrays shared moral visions or mutual dignity."
      },
      {
        "pillar": "Vision for Dignity, Coexistence & Peace",
        "assessment": "⚠️ Partial",
        "evidence": "Supports two-state, cultural coexistence, and democratic partnership — but lacks high-level vision language in public."
      }
    ],
    "strengths": [
      "Clear stance against extremist violence",
      "Advocates democratic norm checks in Israel"
    ],
    "weaknesses": [
      "Political caution limits moral clarity",
      "Achieves moderate balance but lacks emotional stakes"
    ],
    "full_conclusion": "Yair Lapid scores as Partial: he upholds civic norms, rejects violence, and brings pragmatic balance. Yet his cautious rhetoric, lack of deep moral vision, and limited emotional resonance leave him short of full MMR alignment."
  },
  {
    "subject": "Avigdor Lieberman",
    "role": "Opposition Leader / Former Minister of Defense and Finance",
    "affiliation": "Yisrael Beiteinu",
    "category": "israeli-politicians",
    "source_context": "Right-wing secular nationalist, leaders in defense and economic portfolios, critical of Palestinian political structures",
    "overall_alignment": "Weak",
    "pillars": [
      {
        "pillar": "Reject targeting of civilians",
        "assessment": "⚠️ Weak",
        "evidence": "Supports military operations in Gaza and West Bank; civilian impact is seen as collateral rather than moral failure."
      },
      {
        "pillar": "Accountability for Hamas / PA rejectionism",
        "assessment": "✅ Pass",
        "evidence": "Strongly condemns Hamas and challenges PA corruption and inefficiency—calls for robust security measures."
      },
      {
        "pillar": "Accountability for Israeli far‑right rejectionism",
        "assessment": "⚠️ Mixed",
        "evidence": "Critiques religious-nationalist excesses at times, but his alliances often accommodate extremist parties."
      },
      {
        "pillar": "Verified, truthful sources",
        "assessment": "⚠️ Mixed",
        "evidence": "Relies largely on national security data and security rhetoric; rarely prioritizes civilian narratives or independent verification."
      },
      {
        "pillar": "Humanize both peoples",
        "assessment": "⚠️ Weak",
        "evidence": "Focuses solely on Israeli security and national identity; seldom acknowledges Palestinian civilian life or rights."
      },
      {
        "pillar": "Vision for Dignity, Coexistence & Peace",
        "assessment": "⚠️ Weak",
        "evidence": "Envisions security-first state policy but rejects mutual governance or equity frameworks."
      }
    ],
    "strengths": [
      "Strong law-and-order stance",
      "Critiques Hamas and PA failures openly"
    ],
    "weaknesses": [
      "Dismisses Palestinian civilian considerations",
      "Maintains hardline nationalist narrative"
    ],
    "full_conclusion": "Avigdor Lieberman exemplifies a pragmatic yet morally limited posture: he condemns rejectionism for Hamas but privileges security over dignity. His tolerance of far-right elements and sidelining of Palestinian humanity place him well below full MMR standards."
  },
  {
    "subject": "Naftali Bennett",
    "role": "Former Prime Minister",
    "affiliation": "Yamina / Israeli Government (past)",
    "category": "israeli-politicians",
    "source_context": "Led a centrist-right government (2021–2022), combining security credentials and cautious outreach to Gulf states; opposed hardcore settlement expansion in some contexts",
    "overall_alignment": "Partial",
    "pillars": [
      {
        "pillar": "Reject targeting of civilians",
        "assessment": "✅ Pass",
        "evidence": "Bennett has supported IDF restraint in Gaza and condemned extremist violence against civilians across communities."
      },
      {
        "pillar": "Accountability for Hamas / PA rejectionism",
        "assessment": "✅ Pass",
        "evidence": "Criticized Hamas’ tunnel warfare and attacks, while acknowledging limitations and corruption among PA leadership."
      },
      {
        "pillar": "Accountability for Israeli far‑right rejectionism",
        "assessment": "⚠️ Mixed",
        "evidence": "Expressed concern about judicial-political overreach and extremist incitement, but maintained coalitions that included hardliners."
      },
      {
        "pillar": "Verified, truthful sources",
        "assessment": "✅ Strong",
        "evidence": "Used diverse national security, diplomatic, and civil society reports in his policymaking."
      },
      {
        "pillar": "Humanize both peoples",
        "assessment": "⚠️ Partial",
        "evidence": "Spoke at times of Palestinian civilian plight and shared regional interests—though balanced by strong nationalist language."
      },
      {
        "pillar": "Vision for Dignity, Coexistence & Peace",
        "assessment": "⚠️ Partial",
        "evidence": "Supported normalization and mutual economic benefit, but avoided robust public articulation of Palestinian statehood as moral imperative."
      }
    ],
    "strengths": [
      "Promoted Muslim minority rights in Israel",
      "Fostered regional diplomatic normalization"
    ],
    "weaknesses": [
      "Coalition compromises diluted moral positions",
      "Cautious language limited emotional impact on peace vision"
    ],
    "full_conclusion": "Naftali Bennett stands at Partial: he balances security and some outreach, condemns violence across divides, and brought a more inclusive tone—but his coalition politics and lack of moral assertiveness toward full equality prevent full MMR alignment."
  },
    {
    "subject": "Gideon Sa'ar",
    "role": "Opposition Leader",
    "affiliation": "New Hope",
    "category": "israeli-politicians",
    "source_context": "Former minister, currently in opposition; advocates judicial reform and security enhancements",
    "overall_alignment": "Partial",
    "pillars": [
      {
        "pillar": "Reject targeting of civilians",
        "assessment": "✅ Pass",
        "evidence": "Sa’ar condemns terrorism and affirms the importance of minimizing civilian harm in anti-terror operations."
      },
      {
        "pillar": "Accountability for Hamas / PA rejectionism",
        "assessment": "⚠️ Partial",
        "evidence": "He criticizes Hamas violence, but offers limited framing of PA political responsibilities."
      },
      {
        "pillar": "Accountability for Israeli far‑right rejectionism",
        "assessment": "⚠️ Mixed",
        "evidence": "Sa’ar questions extreme nationalist trends but has joined coalitions including centrist-right figures with mixed records on coexistence."
      },
      {
        "pillar": "Verified, truthful sources",
        "assessment": "✅ Strong",
        "evidence": "Uses official data and credible journalistic analysis in policy discussions."
      },
      {
        "pillar": "Humanize both peoples",
        "assessment": "⚠️ Partial",
        "evidence": "While condemning violence, seldom articulates Palestinian civilian narratives or grief."
      },
      {
        "pillar": "Vision for Dignity, Coexistence & Peace",
        "assessment": "⚠️ Partial",
        "evidence": "Supports a two-state structure but lacks a detailed civic or emotional vision for peace."
      }
    ],
    "strengths": [
      "Clear anti-terror stance",
      "Centrist–right moderation on Israeli politics"
    ],
    "weaknesses": [
      "Limited Palestinian empathy",
      "Simplistic peace framing without emotional depth"
    ],
    "full_conclusion": "Gideon Sa’ar adopts a balanced-security and moderate democratic posture. He meets several MMR criteria but lacks deeper moral narrative regarding Palestinian humanity and a vision of mutual dignity."
  },
  {
    "subject": "Yair Golan",
    "role": "Opposition MK / Retired Major General",
    "affiliation": "Democratic Union",
    "category": "israeli-politicians",
    "source_context": "Noted for critical remarks on occupation and Jewish morality; involved in peace advocacy after military service",
    "overall_alignment": "Pass",
    "pillars": [
      {
        "pillar": "Reject targeting of civilians",
        "assessment": "✅ Pass",
        "evidence": "Golan promotes restraint in military action and has warned against civilian harm in West Bank operations."
      },
      {
        "pillar": "Accountability for Hamas / PA rejectionism",
        "assessment": "✅ Pass",
        "evidence": "He strongly condemns Hamas terror and endorses PA role in policing and reform."
      },
      {
        "pillar": "Accountability for Israeli far‑right rejectionism",
        "assessment": "✅ Pass",
        "evidence": "Fiercely critiques extremist Judaism and settler violence, warning it threatens democracy’s soul."
      },
      {
        "pillar": "Verified, truthful sources",
        "assessment": "✅ Strong",
        "evidence": "Builds on personal testimony, scholarly ethics, and military documentation for public discourse."
      },
      {
        "pillar": "Humanize both peoples",
        "assessment": "✅ Pass",
        "evidence": "Golan speaks frequently about shared suffering and moral obligations to Palestinians as human beings."
      },
      {
        "pillar": "Vision for Dignity, Coexistence & Peace",
        "assessment": "✅ Pass",
        "evidence": "Advocates equal rights for Palestinians, a democratic civic future, and secular nationalism inclusive of minorities."
      }
    ],
    "strengths": [
      "Moral courage from military critic",
      "Balances security with empathy",
      "Articulates ethical civic vision"
    ],
    "weaknesses": [
      "Political resonance limited among mainstream",
      "Vision has limited public strategic detail"
    ],
    "full_conclusion": "Yair Golan is a rare combination of security experience with moral clarity. He rejects civilian targeting, prescribes accountability across actors, humanizes both sides, and shares a dignified, democratic vision. His MMR alignment is strong."
  },
  {
    "subject": "Hussein al‑Sheikh",
    "role": "PA Cabinet Secretary",
    "affiliation": "Palestinian Authority",
    "category": "palestinian-authority",
    "source_context": "Senior PA official; oversees governance and security coordination with Israel",
    "overall_alignment": "Weak",
    "pillars": [
      {
        "pillar": "Reject targeting of civilians",
        "assessment": "⚠️ Weak",
        "evidence": "Occasionally condemns violence, but PA security coordination with Israel may enable civilian harm."
      },
      {
        "pillar": "Accountability for Hamas / PA rejectionism",
        "assessment": "⚠️ Mixed",
        "evidence": "Occasionally critiques Hamas, but overall messaging remains vague and rarely self-critical of PA structures."
      },
      {
        "pillar": "Accountability for Israeli far‑right rejectionism",
        "assessment": "✅ Pass",
        "evidence": "Public statements at UN and protests highlight settler violence and judicial trends in Israeli far-right governance."
      },
      {
        "pillar": "Verified, truthful sources",
        "assessment": "⚠️ Partial",
        "evidence": "Relies on UN and NGO data for Israeli abuses but less transparent about PA governance failures."
      },
      {
        "pillar": "Humanize both peoples",
        "assessment": "⚠️ Weak",
        "evidence": "Centers Palestinian civilian plight; rarely acknowledges Israeli civilian suffering or fear."
      },
      {
        "pillar": "Vision for Dignity, Coexistence & Peace",
        "assessment": "⚠️ Partial",
        "evidence": "Talks of statehood and sovereignty but lacks emotional integration of Israeli legitimacy or joint civic vision."
      }
    ],
    "strengths": [
      "Speaks truth on settler violence",
      "Maintains PA coordination with Israel avoiding breakdown"
    ],
    "weaknesses": [
      "Often vague on Hamas critique",
      "Does not humanize Israelis",
      "No shared future vision"
    ],
    "full_conclusion": "Hussein al‑Sheikh is a prominent PA insider whose public posture falls short of MMR standards. His leadership is marked by structural caution rather than moral clarity, with limited acknowledgment of civilian impact and no shared moral vision."
  },
  {
    "subject": "Majed Faraj",
    "role": "PA Intelligence Chief",
    "affiliation": "Palestinian Authority",
    "category": "palestinian-authority",
    "source_context": "Heads Palestinian general intelligence; coordinates with Israeli security on counterterrorism operations",
    "overall_alignment": "Weak",
    "pillars": [
      {
        "pillar": "Reject targeting of civilians",
        "assessment": "⚠️ Weak",
        "evidence": "Appears to support intelligence cooperation that may lead to civilian arrests or harm, without broad moral framing against it."
      },
      {
        "pillar": "Accountability for Hamas / PA rejectionism",
        "assessment": "⚠️ Partial",
        "evidence": "Critiques extremist violence but engages in realpolitik; less vocal about internal Palestinian governance failures."
      },
      {
        "pillar": "Accountability for Israeli far‑right rejectionism",
        "assessment": "⚠️ Partial",
        "evidence": "Acknowledges settler violence but frames it principally as security risk rather than a moral failure."
      },
      {
        "pillar": "Verified, truthful sources",
        "assessment": "⚠️ Mixed",
        "evidence": "Operational reports and classified assessments underpin public messaging, but lack transparency on human rights impact."
      },
      {
        "pillar": "Humanize both peoples",
        "assessment": "⚠️ Weak",
        "evidence": "Speeches view Palestinians as security subjects; mentions Israelis only as potential threats."
      },
      {
        "pillar": "Vision for Dignity, Coexistence & Peace",
        "assessment": "⚠️ Weak",
        "evidence": "Offers no public moral vision beyond stability; state control outweighs civic aspiration."
      }
    ],
    "strengths": [
      "Maintains order on security coordination",
      "Addresses extremist threats"
    ],
    "weaknesses": [
      "Lacks moral framework for civilian protection",
      "Militarized view undermines peace narrative"
    ],
    "full_conclusion": "Majed Faraj is emblematic of a security-first PA posture: functional, cautious, but devoid of Moral Mutual Respect. His MMR scoring reveals deeply limited humanization and vision."
  },
  {
    "subject": "Rami Hamdallah",
    "role": "Former PA Prime Minister",
    "affiliation": "Palestinian Authority",
    "category": "palestinian-authority",
    "source_context": "Served as PM 2014–2019; engaged in diplomacy and administration under Abbas",
    "overall_alignment": "Partial",
    "pillars": [
      {
        "pillar": "Reject targeting of civilians",
        "assessment": "✅ Pass",
        "evidence": "Hamdallah publicly condemned violence during his terms and supported governance measures aimed at reducing civilian harm."
      },
      {
        "pillar": "Accountability for Hamas / PA rejectionism",
        "assessment": "⚠️ Partial",
        "evidence": "He criticized Hamas’s violence but maintained PA authority rather than deep institutional reforms."
      },
      {
        "pillar": "Accountability for Israeli far‑right rejectionism",
        "assessment": "✅ Pass",
        "evidence": "Highlighted settler-related violence and legal restrictions at UN forums and international diplomacy."
      },
      {
        "pillar": "Verified, truthful sources",
        "assessment": "⚠️ Partial",
        "evidence": "Cites international reports but often toes the PA line on internal shortcomings."
      },
      {
        "pillar": "Humanize both peoples",
        "assessment": "⚠️ Partial",
        "evidence": "Conveyed Palestinian hardship; occasionally referenced Israeli civilian concerns cautiously."
      },
      {
        "pillar": "Vision for Dignity, Coexistence & Peace",
        "assessment": "⚠️ Partial",
        "evidence": "Endorsed two-state and institution-building but lacked emotional or civic-forward framing."
      }
    ],
    "strengths": [
      "Public opposition to violence",
      "Highlighted Israeli far-right abuses internationally"
    ],
    "weaknesses": [
      "Limited internal accountability",
      "Minimal mutual narrative-building"
    ],
    "full_conclusion": "Rami Hamdallah was a moderate PA technocrat. He meets baseline MMR requirements but stops short of strong moral and emotional engagement with both peoples' rights or a shared vision."
  },
  {
    "subject": "Khaled Meshaal",
    "role": "Senior Hamas Leader (In Exile)",
    "affiliation": "Hamas",
    "category": "hamas-officials",
    "source_context": "Politburo leader based in Qatar (2004–2017); speaks on political strategy and resistance narratives",
    "overall_alignment": "Fail",
    "pillars": [
      {
        "pillar": "Reject targeting of civilians",
        "assessment": "❌ Fail",
        "evidence": "Meshaal has justified armed attacks that include civilian deaths as resistance, and predicated strategy on such violence."
      },
      {
        "pillar": "Accountability for Hamas / PA rejectionism",
        "assessment": "❌ Fail",
        "evidence": "He rejects Israel’s legitimacy and mourns violence as moral acts without internal critique of Hamas’s strategic extremes."
      },
      {
        "pillar": "Accountability for Israeli far‑right rejectionism",
        "assessment": "⚠️ Weak",
        "evidence": "Criticizes Israeli aggression broadly but conflates all Israeli actions as settler-state violence, rationalizing his own cause."
      },
      {
        "pillar": "Verified, truthful sources",
        "assessment": "❌ Fail",
        "evidence": "Relies on ideological and theological narratives rather than fact-based analysis; downplays civilian costs."
      },
      {
        "pillar": "Humanize both peoples",
        "assessment": "❌ Fail",
        "evidence": "Frames Palestinian suffering without any empathy for Israelis; characterizes all Jews in Israel as collective targets."
      },
      {
        "pillar": "Vision for Dignity, Coexistence & Peace",
        "assessment": "❌ Fail",
        "evidence": "Articulates eliminationist goals and rejects coexistence frameworks entirely."
      }
    ],
    "strengths": [],
    "weaknesses": [
      "Glorifies violence professionally",
      "Rejects Israeli existence",
      "Offers no moral or peace vision"
    ],
    "full_conclusion": "Khaled Meshaal scores an MMR Fail: an ideological leader who rejects civilian protection, erases the other, and offers only vindicated resistance."
  },
  {
    "subject": "Mousa Abu Marzook",
    "role": "Senior Hamas Politician",
    "affiliation": "Hamas",
    "category": "hamas-officials",
    "source_context": "Long-term political representative in exile; involved in negotiations and media representation since the 1990s",
    "overall_alignment": "Fail",
    "pillars": [
      {
        "pillar": "Reject targeting of civilians",
        "assessment": "❌ Fail",
        "evidence": "Has defended or rationalized rocket attacks targeting Israeli population centers."
      },
      {
        "pillar": "Accountability for Hamas / PA rejectionism",
        "assessment": "❌ Fail",
        "evidence": "Refuses condemnation of terror campaigns and rejects Israel politically."
      },
      {
        "pillar": "Accountability for Israeli far‑right rejectionism",
        "assessment": "⚠️ Weak",
        "evidence": "Blames Israeli policy broadly but fails to distinguish extremist factions from state legitimacy."
      },
      {
        "pillar": "Verified, truthful sources",
        "assessment": "❌ Fail",
        "evidence": "Uses political justification and propaganda, and often obscures civilian suffering in media narratives."
      },
      {
        "pillar": "Humanize both peoples",
        "assessment": "❌ Fail",
        "evidence": "Portrays Palestinians as victims, with no empathy for Israeli civilians."
      },
      {
        "pillar": "Vision for Dignity, Coexistence & Peace",
        "assessment": "❌ Fail",
        "evidence": "Advocates Hamas’s maximalist program and rejects any coexistence or shared governance."
      }
    ],
    "strengths": [],
    "weaknesses": [
      "Enables extremist violence",
      "Lacks moral or civic vision"
    ],
    "full_conclusion": "Mousa Abu Marzook represents the ideological backbone of Hamas politics. His disregard for civilian protection, refusal to recognize the other, and unhinged narrative make him a clear MMR Fail."
  },
    {
    "subject": "Osama Hamdan",
    "role": "Hamas Representative in Lebanon",
    "affiliation": "Hamas",
    "category": "hamas-officials",
    "source_context": "Longtime political spokesman based in Beirut; known for media appearances defending Hamas positions",
    "overall_alignment": "Fail",
    "pillars": [
      {
        "pillar": "Reject targeting of civilians",
        "assessment": "❌ Fail",
        "evidence": "Hamdan has repeatedly defended attacks targeting Israeli civilians, framing them as legitimate resistance even during media interviews."
      },
      {
        "pillar": "Accountability for Hamas / PA rejectionism",
        "assessment": "❌ Fail",
        "evidence": "Refuses to critique Hamas’s violent ideology and rejects any recognition of Israel’s right to exist."
      },
      {
        "pillar": "Accountability for Israeli far‑right rejectionism",
        "assessment": "⚠️ Weak",
        "evidence": "Routinely denounces Israeli policy broadly, but conflates extremist actions with the entirety of Israeli society."
      },
      {
        "pillar": "Verified, truthful sources",
        "assessment": "❌ Fail",
        "evidence": "Relies on ideological talking points and selective facts to justify Hamas actions, omitting civilian suffering."
      },
      {
        "pillar": "Humanize both peoples",
        "assessment": "❌ Fail",
        "evidence": "Makes no acknowledgement of Israeli civilian trauma; portrays Israelis as Zionist occupiers only."
      },
      {
        "pillar": "Vision for Dignity, Coexistence & Peace",
        "assessment": "❌ Fail",
        "evidence": "Advocates continued armed resistance and rejects any path to coexistence or shared peace."
      }
    ],
    "strengths": [],
    "weaknesses": [
      "Defends violence against civilians",
      "Refuses recognition or moral accountability",
      "Offers no moral or peace framework"
    ],
    "full_conclusion": "Osama Hamdan exemplifies MMR failure: he defends civilian targeting, rejects ideological accountability, erases Israeli humanity, and provides no forward‑looking vision."
  },
  {
    "subject": "Sami Abu Zuhri",
    "role": "Hamas Spokesman",
    "affiliation": "Hamas",
    "category": "hamas-officials",
    "source_context": "Regular media spokesperson in Gaza, frequently quoted after escalation or cross-border incidents",
    "overall_alignment": "Fail",
    "pillars": [
      {
        "pillar": "Reject targeting of civilians",
        "assessment": "❌ Fail",
        "evidence": "Has praised or justified rocket fire that hits civilian areas as defensive or retaliatory action."
      },
      {
        "pillar": "Accountability for Hamas / PA rejectionism",
        "assessment": "❌ Fail",
        "evidence": "Denounces any recognition of Israel and dismisses calls for ceasefire without full Israeli withdrawal."
      },
      {
        "pillar": "Accountability for Israeli far‑right rejectionism",
        "assessment": "⚠️ Weak",
        "evidence": "Blames occupation generally but rarely distinguishes between extremist settlers and democratic Israeli institutions."
      },
      {
        "pillar": "Verified, truthful sources",
        "assessment": "❌ Fail",
        "evidence": "Relies on emotionally charged rhetoric, selective facts, and conspiracy framing without transparent sourcing."
      },
      {
        "pillar": "Humanize both peoples",
        "assessment": "❌ Fail",
        "evidence": "No empathy shown toward Israeli civilian suffering; narratives center Palestinian resistance only."
      },
      {
        "pillar": "Vision for Dignity, Coexistence & Peace",
        "assessment": "❌ Fail",
        "evidence": "Frames peace as conditional on total liberation; rejects coexistence frameworks entirely."
      }
    ],
    "strengths": [],
    "weaknesses": [
      "Glorifies civilian targeting",
      "Denies moral complexity",
      "No peace-forward narrative"
    ],
    "full_conclusion": "Sami Abu Zuhri scores firmly as MMR Fail: he defends civilian targeting, evades accountability, lacks empathy, and does not offer any moral horizon for peace or human dignity."
  },
  {
    "subject": "Rep. Ritchie Torres",
    "role": "U.S. Representative",
    "affiliation": "Democratic Party",
    "category": "us-politicians",
    "source_context": "Member of U.S. Congress since 2021; vocal on human rights, LGBTQ+ issues, and foreign policy",
    "overall_alignment": "Pass",
    "pillars": [
      {
        "pillar": "Reject targeting of civilians",
        "assessment": "✅ Pass",
        "evidence": "Torres has condemned violence on all sides, including terrorist attacks and indiscriminate civilian harm in conflict zones."
      },
      {
        "pillar": "Accountability for Hamas / PA rejectionism",
        "assessment": "✅ Pass",
        "evidence": "Critiques Hamas for extremist violence while supporting humanitarian access for Palestinian civilians."
      },
      {
        "pillar": "Accountability for Israeli far‑right rejectionism",
        "assessment": "✅ Pass",
        "evidence": "Has sharply criticized Israeli settler violence and far‑right policies in the Knesset and U.S. Congress."
      },
      {
        "pillar": "Verified, truthful sources",
        "assessment": "✅ Strong",
        "evidence": "Cites human rights groups, independent media, and verified reports to back his positions."
      },
      {
        "pillar": "Humanize both peoples",
        "assessment": "✅ Pass",
        "evidence": "Elevates both Israeli and Palestinian civilian narratives in public statements and debates."
      },
      {
        "pillar": "Vision for Dignity, Coexistence & Peace",
        "assessment": "✅ Pass",
        "evidence": "Advocates two‑state solution, shared civic values, and legislative safeguards for mutual rights."
      }
    ],
    "strengths": [
      "Consistent moral clarity",
      "Brings intersectional human rights framing",
      "Balanced and empathetic foreign policy stance"
    ],
    "weaknesses": [],
    "full_conclusion": "Rep. Ritchie Torres stands as an MMR exemplar: he rejects civilian violence, holds both sides accountable, grounds arguments in truth, and promotes dignified peace frameworks. His posture is morally robust and aligned."
  },
  {
    "subject": "Mehdi Hasan",
    "role": "Journalist / Host",
    "affiliation": "Al Jazeera English",
    "category": "journalists",
    "source_context": "Anchor and political correspondent; known for hard-hitting interviews and analysis on US and Middle East politics",
    "overall_alignment": "Partial",
    "pillars": [
      {
        "pillar": "Reject targeting of civilians",
        "assessment": "✅ Pass",
        "evidence": "Has condemned civilian casualties in Gaza and questioned officials on attacks from all sides."
      },
      {
        "pillar": "Accountability for Hamas / PA rejectionism",
        "assessment": "✅ Pass",
        "evidence": "Pressures guests on Hamas's human rights record and tactics in his interviews."
      },
      {
        "pillar": "Accountability for Israeli far‑right rejectionism",
        "assessment": "✅ Pass",
        "evidence": "Challenges Israeli officials on settler violence and rights violations during on-air interviews."
      },
      {
        "pillar": "Verified, truthful sources",
        "assessment": "✅ Strong",
        "evidence": "References NGO investigations, official documents, and credible media reporting in his journalism."
      },
      {
        "pillar": "Humanize both peoples",
        "assessment": "⚠️ Partial",
        "evidence": "Elevates Palestinian voices strongly; less consistent at humanizing Israeli civilian experience in his coverage."
      },
      {
        "pillar": "Vision for Dignity, Coexistence & Peace",
        "assessment": "⚠️ Partial",
        "evidence": "Articulates calls for Palestinian dignity and dialogue but less emphasis on mutual civic frameworks."
      }
    ],
    "strengths": [
      "Rigorous accountability orientation",
      "Well-sourced and investigative",
      "Boldly challenges power across contexts"
    ],
    "weaknesses": [
      "Coverage skewed toward Palestinian narrative",
      "Less balanced emotional framing"
    ],
    "full_conclusion": "Mehdi Hasan demonstrates strong journalistic integrity and accountability across sides, but his coverage leans more heavily toward Palestinian plights, limiting his overall narrative symmetry. He scores as Partial MMR."
  },
  {
    "subject": "Christiane Amanpour",
    "role": "Chief International Anchor",
    "affiliation": "CNN",
    "category": "journalists",
    "source_context": "Veteran international correspondent; reports from conflict zones; focuses on human rights and global affairs",
    "overall_alignment": "Pass",
    "pillars": [
      {
        "pillar": "Reject targeting of civilians",
        "assessment": "✅ Pass",
        "evidence": "Amanpour consistently highlights civilian casualties and repeatedly calls for protection of noncombatants in conflict zones."
      },
      {
        "pillar": "Accountability for Hamas / PA rejectionism",
        "assessment": "✅ Pass",
        "evidence": "Challenges Hamas officials and narrative choices during interviews and panels."
      },
      {
        "pillar": "Accountability for Israeli far‑right rejectionism",
        "assessment": "✅ Pass",
        "evidence": "Has confronted Israeli settlement policy and government rhetoric in on-camera questioning."
      },
      {
        "pillar": "Verified, truthful sources",
        "assessment": "✅ Strong",
        "evidence": "Draws upon multinational ground reporting, UN data, and firsthand testimony."
      },
      {
        "pillar": "Humanize both peoples",
        "assessment": "✅ Pass",
        "evidence": "Gives airtime to both Israeli and Palestinian civilians with equal empathy and narrative framing."
      },
      {
        "pillar": "Vision for Dignity, Coexistence & Peace",
        "assessment": "✅ Pass",
        "evidence": "Often frames her stories around prospects for justice, reconciliation, and shared futures."
      }
    ],
    "strengths": [
      "Ethical, balanced frontline reporting",
      "Empathetic human interest storytelling",
      "Maintains high journalistic standards"
    ],
    "weaknesses": [],
    "full_conclusion": "Christiane Amanpour exemplifies MMR-aligned journalism: she upholds civilian dignity, supports comprehensive accountability, uses verified sources, and centers mutual humanity in her reporting."
  },
  {
    "subject": "Anderson Cooper",
    "role": "Anchor / Correspondent",
    "affiliation": "CNN",
    "category": "journalists",
    "source_context": "Veteran news anchor; has covered conflicts including Middle East and war zones; known for field reporting",
    "overall_alignment": "Pass",
    "pillars": [
      {
        "pillar": "Reject targeting of civilians",
        "assessment": "✅ Pass",
        "evidence": "Cooper regularly reports on civilian suffering and repeatedly advocates for protection of noncombatants."
      },
      {
        "pillar": "Accountability for Hamas / PA rejectionism",
        "assessment": "✅ Pass",
        "evidence": "Presses Hamas-affiliated figures on civilian harm and condemns indiscriminate rocket fire."
      },
      {
        "pillar": "Accountability for Israeli far‑right rejectionism",
        "assessment": "✅ Pass",
        "evidence": "Questions Israeli officials on extremist settler actions and the moral implications of state policy in the field."
      },
      {
        "pillar": "Verified, truthful sources",
        "assessment": "✅ Strong",
        "evidence": "Relies on firsthand interviews, independent investigations, and on-site reporting."
      },
      {
        "pillar": "Humanize both peoples",
        "assessment": "✅ Pass",
        "evidence": "Gives voice to civilians on both sides with equal attention and emotional framing."
      },
      {
        "pillar": "Vision for Dignity, Coexistence & Peace",
        "assessment": "✅ Pass",
        "evidence": "Highlights reconstruction needs, humanitarian collaboration, and shared stories of survival and hope."
      }
    ],
    "strengths": [
      "On-the-ground empathy",
      "Balanced conflict journalism",
      "Maintains moral consistency"
    ],
    "weaknesses": [],
    "full_conclusion": "Anderson Cooper consistently lives up to MMR values in his journalism: he forefronts civilian stories, demands accountability, and communicates shared resilience and peace aspirations."
  },
  {
    "subject": "Clarissa Ward",
    "role": "Chief International Correspondent",
    "affiliation": "CNN",
    "category": "journalists",
    "source_context": "Has reported from Gaza, Iraq, Syria; known for immersive frontline presence and detailed conflict narratives",
    "overall_alignment": "Pass",
    "pillars": [
      {
        "pillar": "Reject targeting of civilians",
        "assessment": "✅ Pass",
        "evidence": "Ward's field coverage emphasizes civilian harm in conflict zones and advocates for humanitarian access."
      },
      {
        "pillar": "Accountability for Hamas / PA rejectionism",
        "assessment": "✅ Pass",
        "evidence": "Challenges Hamas spokespeople about civilian casualties and ideological justifications in interviews."
      },
      {
        "pillar": "Accountability for Israeli far‑right rejectionism",
        "assessment": "✅ Pass",
        "evidence": "Questions Israeli military and politicians on tactics, civilian impact, and extremist settler violence."
      },
      {
        "pillar": "Verified, truthful sources",
        "assessment": "✅ Strong",
        "evidence": "Her reporting integrates firsthand footage, NGO data, and seasoned field analysis."
      },
      {
        "pillar": "Humanize both peoples",
        "assessment": "✅ Pass",
        "evidence": "Conveys personal stories from Israeli and Palestinian civilians with equivalent emotional resonance."
      },
      {
        "pillar": "Vision for Dignity, Coexistence & Peace",
        "assessment": "✅ Pass",
        "evidence": "Coverage often frames hope for durable civilian peace and post-conflict rebuilding as shared goals."
      }
    ],
    "strengths": [
      "Ground-level, empathetic field reporting",
      "Balanced narrative framing",
      "Elevates civic resilience"
    ],
    "weaknesses": [],
    "full_conclusion": "Clarissa Ward stands as a model MMR journalist—her immersive, even-handed coverage of civilian-suffering, accountability, and mutual humanity earns her a firm Pass in moral journalism."
  },
    {
    "subject": "Jeremy Bowen",
    "role": "Chief International Editor",
    "affiliation": "BBC",
    "category": "journalists",
    "source_context": "Veteran Middle East correspondent; reports from conflict zones and geopolitical flashpoints",
    "overall_alignment": "Pass",
    "pillars": [
      {
        "pillar": "Reject targeting of civilians",
        "assessment": "✅ Pass",
        "evidence": "Bowen frequently highlights civilian casualties and advocates for proportionality in armed conflict."
      },
      {
        "pillar": "Accountability for Hamas / PA rejectionism",
        "assessment": "✅ Pass",
        "evidence": "He challenges Hamas rhetoric in analysis while giving due space to Gaza civilians' perspectives."
      },
      {
        "pillar": "Accountability for Israeli far‑right rejectionism",
        "assessment": "✅ Pass",
        "evidence": "Bowen has reported on settler violence and extremist policies in critical context."
      },
      {
        "pillar": "Verified, truthful sources",
        "assessment": "✅ Strong",
        "evidence": "Combines expert interviews, on‑the‑ground reporting, and verified NGO data."
      },
      {
        "pillar": "Humanize both peoples",
        "assessment": "✅ Pass",
        "evidence": "Presents personal stories from both Palestinian and Israeli civilians with empathetic balance."
      },
      {
        "pillar": "Vision for Dignity, Coexistence & Peace",
        "assessment": "✅ Pass",
        "evidence": "Often describes peace pathways that emphasize justice, memory, and shared futures."
      }
    ],
    "strengths": [
      "Nuanced conflict coverage",
      "Sympathetic to all civilian voices",
      "High journalistic standards"
    ],
    "weaknesses": [
      "Constrained by broadcaster neutrality rules",
      "Focuses on reportage over normative framing"
    ],
    "full_conclusion": "Jeremy Bowen’s long-standing field reporting and balanced narrative consistently meet MMR standards. He rejects civilian targeting, holds all sides to account, uses verifiable sources, and humanizes both communities. His coverage supports dignified vision and shared futures."
  },
  {
    "subject": "Omar Shakir",
    "role": "Human Rights Director",
    "affiliation": "Human Rights Watch (formerly Israel/Palestine Director)",
    "category": "ngo-leaders",
    "source_context": "Leads reporting on human rights conditions in Israel, Gaza, and West Bank; engages in legal advocacy",
    "overall_alignment": "Pass",
    "pillars": [
      {
        "pillar": "Reject targeting of civilians",
        "assessment": "✅ Pass",
        "evidence": "Shakir has documented and condemned civilian harm resulting from all parties' actions."
      },
      {
        "pillar": "Accountability for Hamas / PA rejectionism",
        "assessment": "✅ Pass",
        "evidence": "Reports critique Hamas tactics, including civilian displacement, governance failures, and armed assaults."
      },
      {
        "pillar": "Accountability for Israeli far‑right rejectionism",
        "assessment": "✅ Strong",
        "evidence": "Shakir publicly condemns settler violence, institutional discrimination, and military policy."
      },
      {
        "pillar": "Verified, truthful sources",
        "assessment": "✅ Strong",
        "evidence": "HRW reports use rigorous methodology, interviews, and transparent sourcing."
      },
      {
        "pillar": "Humanize both peoples",
        "assessment": "⚠️ Partial",
        "evidence": "Centers Palestinian suffering extensively; less frequent references to Israeli civilian fears or trauma."
      },
      {
        "pillar": "Vision for Dignity, Coexistence & Peace",
        "assessment": "⚠️ Partial",
        "evidence": "Calls for legal accountability and rights-based frameworks but lacks a fully articulated shared future narrative."
      }
    ],
    "strengths": [
      "Rigorous human rights documentation",
      "Clear condemnation of violence and abuse",
      "Strong empirical and legal basis"
    ],
    "weaknesses": [
      "Coverage weighted toward Palestinian experience",
      "Limited emphasis on Israeli civilian perspective"
    ],
    "full_conclusion": "Omar Shakir’s work exemplifies principled human rights accountability. His research-led critique and condemnation of abuses forms a strong moral core—though cultivation of a fully symmetrized narrative would enhance his alignment."
  },
  {
    "subject": "Hagai El‑Ad",
    "role": "Former Executive Director",
    "affiliation": "B’Tselem",
    "category": "ngo-leaders",
    "source_context": "Led Israeli human rights NGO; issued high-profile reports on occupation and settler violence",
    "overall_alignment": "Pass",
    "pillars": [
      {
        "pillar": "Reject targeting of civilians",
        "assessment": "✅ Pass",
        "evidence": "El‑Ad condemns civilian harm and documents unlawful strikes and settler attacks."
      },
      {
        "pillar": "Accountability for Hamas / PA rejectionism",
        "assessment": "⚠️ Partial",
        "evidence": "Criticizes Hamas’ attacks on civilians but less frequently addresses PA governance failure."
      },
      {
        "pillar": "Accountability for Israeli far‑right rejectionism",
        "assessment": "✅ Strong",
        "evidence": "Has led campaigns against settler violence and state policies promoting discrimination."
      },
      {
        "pillar": "Verified, truthful sources",
        "assessment": "✅ Strong",
        "evidence": "Reports include verified testimonies, legal analysis, and transparent methodology."
      },
      {
        "pillar": "Humanize both peoples",
        "assessment": "⚠️ Partial",
        "evidence": "Humanizes Palestinians thoroughly; acknowledges Israelis only at institutional level, less frequently civilian grief."
      },
      {
        "pillar": "Vision for Dignity, Coexistence & Peace",
        "assessment": "⚠️ Partial",
        "evidence": "Articulates human rights-based future but less narrative framing of mutual society or reconciliation."
      }
    ],
    "strengths": [
      "Credible human rights oversight",
      "Bold critique of state excess",
      "Empirical grounding"
    ],
    "weaknesses": [
      "Civilian empathy tilt",
      "Low emotional or aspirational balance"
    ],
    "full_conclusion": "Hagai El‑Ad delivers a firm human rights foundation aligned with MMR’s structural demands. While his coverage is historically Palestinian-heavy, his clear ethical framing and documentation are highly effective."
  },
  {
    "subject": "Yuli Novak",
    "role": "Human Rights Advocate",
    "affiliation": "Gisha",
    "category": "ngo-leaders",
    "source_context": "Director and co-founder of Israeli NGO monitoring restrictions on movement in Gaza; engages in policy advocacy",
    "overall_alignment": "Pass",
    "pillars": [
      {
        "pillar": "Reject targeting of civilians",
        "assessment": "✅ Pass",
        "evidence": "Novak has publicly opposed civilian movement restrictions and collective punishment."
      },
      {
        "pillar": "Accountability for Hamas / PA rejectionism",
        "assessment": "⚠️ Partial",
        "evidence": "Critiques Hamas’ governance of Gaza but focuses more on Israeli restrictions."
      },
      {
        "pillar": "Accountability for Israeli far‑right rejectionism",
        "assessment": "✅ Strong",
        "evidence": "Challenges Israeli policy that limits rights, funds legal petitions and reports."
      },
      {
        "pillar": "Verified, truthful sources",
        "assessment": "✅ Strong",
        "evidence": "Uses legal documentation, interviews, and policy analysis."
      },
      {
        "pillar": "Humanize both peoples",
        "assessment": "⚠️ Partial",
        "evidence": "Highlights Palestinian civilian voice; Israeli perspective appears mainly as policy actors, not people."
      },
      {
        "pillar": "Vision for Dignity, Coexistence & Peace",
        "assessment": "⚠️ Partial",
        "evidence": "Envisions legal frameworks yet lacks descriptive civic mutual-future narrative."
      }
    ],
    "strengths": [
      "Rights-based policy clarity",
      "Legal expertise on civilian consequences"
    ],
    "weaknesses": [
      "Civilian narrative imbalance",
      "Limited aspirational framing"
    ],
    "full_conclusion": "Yuli Novak stands for procedural justice and accountability. Her legal activism meets MMR’s structural criteria, but further enhancement in empathetic and shared vision could deepen her alignment."
  },
  {
    "subject": "Kenneth Roth",
    "role": "Executive Director (former)",
    "affiliation": "Human Rights Watch",
    "category": "ngo-leaders",
    "source_context": "Led HRW from 1993–2022; influential global human rights policymaker and author",
    "overall_alignment": "Pass",
    "pillars": [
      {
        "pillar": "Reject targeting of civilians",
        "assessment": "✅ Pass",
        "evidence": "Roth has led reports condemning civilian casualties from all sides, including Israeli military and militant groups."
      },
      {
        "pillar": "Accountability for Hamas / PA rejectionism",
        "assessment": "✅ Pass",
        "evidence": "Has publicly criticized Hamas policies and attacks in multiple reports."
      },
      {
        "pillar": "Accountability for Israeli far‑right rejectionism",
        "assessment": "✅ Strong",
        "evidence": "Under his leadership, HRW condemned settler violence and state discriminatory policy."
      },
      {
        "pillar": "Verified, truthful sources",
        "assessment": "✅ Strong",
        "evidence": "Reports are grounded in rigorous, peer-reviewed methodology and diverse testimony."
      },
      {
        "pillar": "Humanize both peoples",
        "assessment": "⚠️ Partial",
        "evidence": "Centering human stories globally, he sometimes emphasizes Palestinian suffering more heavily."
      },
      {
        "pillar": "Vision for Dignity, Coexistence & Peace",
        "assessment": "⚠️ Partial",
        "evidence": "Promotes universal rights frameworks but less often extends to mutual political-community power-sharing visions."
      }
    ],
    "strengths": [
      "Global human rights authority",
      "Comprehensive accountability reporting",
      "High source integrity"
    ],
    "weaknesses": [
      "Coverage often emphasizes abuses by states over non-state actors’ narratives",
      "Lacks sustained narrative on shared civic future"
    ],
    "full_conclusion": "Kenneth Roth’s leadership in HRW exemplifies principled MMR engagement through global rights advocacy. His structure and integrity are strong, though enhanced moral symmetry and future-focused messaging would further his alignment."
  },{
    "subject": "Benjamin Netanyahu",
    "role": "Prime Minister",
    "affiliation": "Israeli Government",
    "category": "israeli-politicians",
    "source_context": "Public speeches, policy actions during terms (2009–2024), war-time leadership, international statements.",
    "pillars": [
      {
        "pillar": "Reject targeting of civilians",
        "assessment": "❌ Fail",
        "evidence": "While Netanyahu states that Israel does not target civilians, his government's military policies (e.g., in Gaza 2014, 2021, 2023) often show disregard for proportionality and civilian safety. Civilian infrastructure is frequently struck, and no accountability is applied internally."
      },
      {
        "pillar": "Accountability for Hamas / PA rejectionism",
        "assessment": "✅ Pass",
        "evidence": "Clearly identifies Hamas as a rejectionist, terrorist actor and condemns its use of human shields and refusal to recognize Israel. Criticized the PA when it has failed to distance itself from Hamas."
      },
      {
        "pillar": "Accountability for Israeli far-right rejectionism",
        "assessment": "❌ Fail",
        "evidence": "Netanyahu has repeatedly empowered far-right extremists, including ministers who openly incite against Arabs and reject Palestinian statehood. He shields them from accountability and has formed coalitions that mainstream ultra-nationalist ideologies."
      },
      {
        "pillar": "Verified, truthful sources",
        "assessment": "⚠️ Mixed",
        "evidence": "Often uses factual security threats to justify actions but distorts context. His narratives frequently omit Palestinian suffering or civilian tolls. In some speeches and international media, he frames Palestinian nationalism as inherently antisemitic or terroristic."
      },
      {
        "pillar": "Humanize both peoples",
        "assessment": "⚠️ Weak",
        "evidence": "He appeals strongly to Jewish trauma and Israeli security fears, but rarely humanizes Palestinians as a people with dignity and aspirations. Palestinian civilians are typically framed only in the context of terrorism or as human shields."
      },
      {
        "pillar": "Vision for Dignity, Coexistence & Peace",
        "assessment": "❌ Fail",
        "evidence": "Netanyahu consistently rejects Palestinian statehood, proposes long-term military control over Palestinians, and offers no vision for coexistence or equal rights. His future framing is zero-sum and power-dominant, with no shared moral horizon."
      }
    ],
    "overall_alignment": "Fail",
    "strengths": [
      "Clear condemnation of Hamas as a terrorist actor.",
      "Consistent articulation of Israeli Jewish trauma and fear.",
      "Appeals to Western audiences on security-based moral terms."
    ],
    "weaknesses": [
      "Shields far-right Israeli extremists from accountability.",
      "Frames Palestinians through securitized and dehumanized lenses.",
      "Offers no dignity-based vision of peace.",
      "Military policies result in high civilian harm without internal accountability."
    ],
    "full_conclusion": "Benjamin Netanyahu embodies a morally asymmetrical posture under the MMR framework. While he forcefully condemns Hamas and articulates the traumas facing Israeli Jews, he simultaneously empowers ultra-nationalist forces that promote permanent subjugation of Palestinians. His policy record reflects rejection of equal dignity, with no genuine peace proposal on the table. In public statements, Netanyahu justifies Israeli actions primarily through the lens of Jewish historical trauma and existential threat. But this framework often erases Palestinian civilian suffering and leaves no room for a shared future. His rejection of Palestinian statehood, tolerance of settler violence, and alliances with religious extremists result in an MMR profile that fails on humanization, vision, and proportionality. Despite a coherent security narrative, his overall leadership does not meet the structural, moral, or emotional requirements of Mutual Moral Respect."
  }
  
  
]

